Revit 2027 API
BuiltInFailures.StairRampFailures.CannotPlaceBalusterPatterns Property
 Can't place Baluster Patterns
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlaceBalusterPatterns { get; }
Public Shared ReadOnly Property CannotPlaceBalusterPatterns As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlaceBalusterPatterns {
	FailureDefinitionId^ get ();
}
static member CannotPlaceBalusterPatterns : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace